#!/usr/bin/env python
# -*- coding: utf-8 -*-
"""
    @Time    : 2018/6/4
    @Author  : LiuXueWen
    @Site    : 
    @File    : 707. Optimal Account Balancing.py
    @Software: PyCharm
    @Description:
        描述
            给一有向图,每一条边用一个 三元组 表示, 比如 [u, v, w] 代表权值为 w 的从 u 到 v 的一条边. 计算出保证每个点的权重相等需要添加的最少的边数. 也就是说, 指向这一点的边权重总和等于这个点指向其他点的边权重之和.

            注意 u ≠ v 且 w > 0
            下标不一定是线性的, 比如 顶点下标可以为 0,1,2, 也可以为 0,2,6.

        样例
            给出图 [[0,1,10],[2,0,5]]
            返回 2
            需要添加两条边
            它们是 [1,0,5] 以及 [1,2,5]

            给出图 [[0,1,10],[1,0,1],[1,2,5],[2,0,5]]
            返回 1
            只需要添加一条边 [1,0,4]
"""